import React, { useState } from 'react';
import ArabicText from './homeText';

const Azrar = () => {
  const containerStyle = {
    padding:0,
    width: '100%',
    height: '100%',
    backgroundImage: 'url("/pics/bg_pic.png")',
    backgroundPosition: 'center', // Adjust as needed
    zIndex: 1, // Set a lower z-index

  };

  const linkStyle = {
    display: 'block',
    fontFamily: 'Tajawal',
    fontWeight: 500,
    color: '#000000',
    fontSize: '18px',
    lineHeight: '21.6px',
    textDecoration: 'none',
    backgroundColor: '#808080', // Gray color
    transition: 'color 0.3s', // Smooth transition for color change

  };

  const topics = [
    'بولينج', 'أغنية', 'المسؤولية', 'سرطان', 'جودو', 'مفرش الطاولة', 'كينيث', 'شريحة', 'سمك الأنقليس',
  'فلسفة', 'تقسيم', 'قاموس', 'بولينج', 'ساحل', 'المملكة المتحدة', 'أنتوني', 'هوكي', 'مفتاح التبديل', 'الإنترنت',
  'جون', 'رقص', 'بت', 'ضوء', 'حوت', 'بولينج', 'بوفيه', 'إحساس', 'تايلاند', 'سويسرا', 'اليعسوب', 'جلد',
  'نسخ', 'جاذبية', 'أوروبا', 'كوريا الجنوبية', 'هيرون', 'رغبي', 'ماعز', 'شبت', 'قولون', 'العذراء', 'سرير الطفل', 'إنتاج',
  'بروتوكول', 'كاتشب', 'مزرعة', 'حدود', 'ولاية', 'أمان', 'الانضمام', 'لوحة المفاتيح', 'لوحة المفاتيح', 'صرف', 'أشعة الشمس',
  'جدول', 'درجة', 'سباحة', 'وردة', 'أرضية', 'علامة تجارية', 'دراجة نارية', 'قش', 'جينز', 'مقدمة', 'همبرجر',
  'تفويض', 'قوس الأقواس', 'آسيا', 'آلية', 'عبد', 'بالينيز', 'تنورة', 'إضافة', 'رأي', 'منشار', 'جنسية', 'سكوتر',
  'ملابس داخلية', 'نصيحة', 'عقل', 'جراح', 'مال', 'نسر', 'هندسة معمارية', 'غبار', 'إخطار', 'بومة', 'طب', 'ابن الأخ',
  'الطائر البحري', 'وسائط متعددة', 'شواية', 'ساعة الرمل', 'حلاق', 'طبيب العيون', 'سفينة', 'رمح', 'فكرة', 'أخصائي التخدير',
  'حلم', 'منجم', 'شمعة', 'إعاقة', 'آثار', 'ماسكارا', 'طبيب العيون', 'سفينة', 'رمح', 'فكرة', 'أخصائي التخدير', 'حلم',
  'منجم', 'شمعة', 'إعاقة', 'آثار', 'ماسكارا', 'شمعة', 'إعاقة', 'آثار', 'ماسكارا', 'ماسكارا', 'شمعة', 'إعاقة',
  'آثار', 'ماسكارا', 'توماس','بولينج', 'أغنية', 'المسؤولية', 'سرطان', 'جودو', 'مفرش الطاولة', 'كينيث', 'شريحة', 'سمك الأنقليس',
  'فلسفة', 'تقسيم', 'قاموس', 'بولينج', 'ساحل', 'المملكة المتحدة', 'أنتوني', 'هوكي', 'مفتاح التبديل', 'الإنترنت',
  'جون', 'رقص', 'بت', 'ضوء', 'حوت', 'بولينج', 'بوفيه', 'إحساس', 'تايلاند', 'سويسرا', 'اليعسوب', 'جلد',
  'نسخ', 'جاذبية', 'أوروبا', 'كوريا الجنوبية', 'هيرون', 'رغبي', 'ماعز', 'شبت', 'قولون', 'العذراء', 'سرير الطفل', 'إنتاج',
  'بروتوكول', 'كاتشب', 'مزرعة', 'حدود', 'ولاية', 'أمان', 'الانضمام', 'لوحة المفاتيح', 'لوحة المفاتيح', 'صرف', 'أشعة الشمس',
  'جدول', 'درجة', 'سباحة', 'وردة', 'أرضية', 'علامة تجارية','آلية', 'عبد', 'بالينيز', 'تنورة', 'إضافة', 'رأي', 'منشار', 'جنسية', 'سكوتر',
  'ملابس داخلية', 'نصيحة', 'عقل', 'جراح', 'مال', 'نسر', 'هندسة معمارية', 'غبار', 'إخطار', 'بومة', 'طب', 'ابن الأخ',
  'جدول', 'درجة', 'سباحة', 'وردة', 'أرضية', 'علامة تجارية','آلية', 'عبد', 'بالينيز', 'تنورة', 'إضافة', 'رأي', 'منشار', 'جنسية', 'سكوتر',
  'الطائر البحري',  'ملابس داخلية', 'نصيحة', 'عقل', 'جراح', 'مال', 'نسر', 'هندسة معمارية', 'غبار', 'إخطار', 'بومة', 'طب', 'ابن الأخ',
  'جدول', 'درجة', 'سباحة', 'وردة', 'أرضية', 'علامة تجارية','آلية', 'عبد', 'بالينيز', 'تنورة', 'إضافة', 'رأي', 'منشار', 'جنسية', 'سكوتر',
  'الطائر البحري', 'بولينج', 'أغنية', 'المسؤولية', 'سرطان', 'جودو', 'مفرش الطاولة', 'كينيث', 'شريحة', 'سمك الأنقليس',
];

const hoverLinkStyle = {
    backgroundColor: '#fff', // White background on hover
    color: 'rgba(4, 156, 120, 0.60)', // Text color with 26% opacity on hover
    transition: 'background-color 0.3s, color 0.4s', // Smooth transition for color change
    };

  const [isHovered, setHovered] = useState(null);

  const handleMouseEnter = (index) => {
    setHovered(index);
  };

  const handleMouseLeave = () => {
    setHovered(null);
  };

  return (
    <div className="random-topics-wrapper" style={containerStyle}>
         <ArabicText /> {/* Move ArabicText outside the link container */}
      <ul>
        {topics.map((topic, index) => (
          <a
            key={index}
            href={`/${topic}`}
            style={{
              ...linkStyle,
              ...(isHovered === index && hoverLinkStyle),
            }}
            onMouseEnter={() => handleMouseEnter(index)}
            onMouseLeave={handleMouseLeave}
          >
            {topic}
          </a>
          
        ))}
      </ul>
    </div>
  );
}

export default Azrar;